Repository: davidpovarsky/hanlin-ai
Catalog: AI_HLY/Resource/Localizable.xcstrings
Source language: zh_hans
Languages: en, he

source: 记忆档案功能用于聊天，受支持的模型会自动在聊天时记住你的喜好并在需要的时候主动回忆这些喜好。
en: The Memory Archive feature works in chat: supported models will automatically remember your preferences during conversations and proactively recall them when needed.
he: The Memory Archive feature works in chat: supported models will automatically remember your preferences during conversations and proactively recall them when needed.

source: 记忆编辑
en: Memory Editing
he: Memory Editing

source: 设定个性化内容，使得模型在对话时了解你的需求与偏好，更好的进行回复。
en: Set personalized content so that the model understands your needs and preferences during conversations, allowing for better responses.
he: הגדר תוכן מותאם אישית כך שהמודל יבין את הצרכים וההעדפות שלך במהלך השיחות, מה שמאפשר תגובות טובות יותר.

source: 设置
en: Settings
he: הגדרות

source: 设置 %@ API 密钥，以开启该天气服务
en: Set the %@ API key to enable this weather service.
he: הגדירו API Key של %@ כדי להפעיל את שירות מזג האוויר הזה.

source: 设置 %@ API密钥，以启用该厂商的模型
en: Set the %@ API key to enable the vendor's model.
he: הגדירו API Key של %@ כדי להפעיל את מודלי הספק.

source: 设置 %@ API密钥，以开启该地图引擎
en: Set the %@ API key to enable this map engine.
he: הגדירו API Key של %@ כדי להפעיל את מנוע המפות הזה.

source: 设置 %@ API密钥，以开启该搜索引擎
en: Set the %@ API key to enable this search engine.
he: הגדירו API Key של %@ כדי להפעיל את מנוע החיפוש הזה.

source: 设置代码功能，以便在与支持工具的模型对话时，模型为你运行Python代码，或查看模型为你制作网页内容，并与其交互。
en: Enable the code function to allow supported models to run Python code or generate web content during conversations.
he: Enable the code function to allow supported models to run Python code or generate web content during conversations.

source: 设置健康功能，以便在与支持工具的模型对话时，模型能够获取你的健康信息或帮你记录健康、饮食等信息。
en: Enable health functions so supported models can access or record your health and dietary information.
he: Enable health functions so supported models can access or record your health and dietary information.

source: 设置地图功能，以便在与支持工具的模型对话时，更好的获取位置相关的信息并让模型向你展示地图
en: Enable the map function to allow the model to access location-related information and display maps during conversations.
he: Enable the map function to allow the model to access location-related information and display maps during conversations.

source: 设置天气功能，以便在与支持工具的模型对话时，获取实时天气信息和未来天气预报
en: Enable the weather feature to obtain real-time weather information and future forecasts when conversing with models that support this tool.
he: Enable the weather feature to obtain real-time weather information and future forecasts when conversing with models that support this tool.

source: 设置搜索功能，以便在聊天对话时获取互联网内容，提升回答效果。个性化的设置能最大程度的平衡你的需求与检索带来的成本消耗
en: Enable the search function to allow models to fetch internet content during chats, improving response quality; personalized settings balance your needs and retrieval costs.
he: אפשר את פונקציית החיפוש כדי לאפשר לדגמים להביא תוכן אינטרנט במהלך צ'אטים, ולשפר את איכות התגובה; הגדרות מותאמות אישית מאזנות את הצרכים שלך ועלויות האחזור שלך.

source: 设置日历功能，以便在与支持工具的模型对话时，获取日历日程、提醒事项信息或者让模型写入日历日程、提醒事项
en: Enable calendar functions to let supported models retrieve schedules and reminders or add events to your calendar.
he: Enable calendar functions to let supported models retrieve schedules and reminders or add events to your calendar.

source: 设置画布功能，以便在与支持工具的模型对话时，模型能够使用画布工具，带来更好的长文本、大段落或结构化内容的输出编辑体验。
en: Enable canvas function so that when interacting with models that support tools, the model can use the canvas tool to provide a better editing experience for long texts, large paragraphs, or structured content output.
he: אפשר את פונקציית הקנבס כך שבעת אינטראקציה עם מודלים התומכים בכלים, המודל יכול להשתמש בכלי הקנבס כדי לספק חווית עריכה טובה יותר עבור טקסטים ארוכים, פסקאות גדולות או פלט תוכן מובנה.

source: 设置知识功能，以便在聊天对话时翻找知识背包，获取私有知识库内容，提升回答效果。
en: Enable the knowledge function to let models search your knowledge backpack for private content during chats, enhancing response effectiveness.
he: אפשר את פונקציית הידע כדי לאפשר לדוגמניות לחפש בתרמיל הידע שלך תוכן פרטי במהלך צ'אטים, ולשפר את יעילות התגובה.

source: 设置系统消息
en: Set System Message
he: Set System Message

source: 该厂商暂未支持
en: Not Supported
he: Not Supported

source: 语言设置
en: Language Settings
he: Language Settings

source: 语音
en: Speech
he: Speech

source: 语音模型
en: Speech Model
he: מודל קול

source: 语音模型将用于合成语音。选择 Siri 模型可使用本地合成，而选择大模型合成将通过 API 请求生成语音，后者需要配置有效的 API Key。
en: Speech models will be used to synthesize speech. Selecting the Siri model will use native synthesis, while selecting Large Model Synthesis will generate speech via API requests, the latter requiring a valid API Key to be configured.
he: מודלים של דיבור ישמשו לסינתזה של דיבור. בחירה במודל של Siri תשתמש בסינתזה מקורית, בעוד שבחירה בסינתזה של מודלים גדולים תיצור דיבור באמצעות בקשות API, שהאחרונות מחייבות להגדיר מפתח API חוקי.

source: 语音生成
en: Speech Generation
he: Speech Generation

source: 语音由%@生成
en: Generated by %@
he: Generated by %@

source: 说明
en: Note
he: Note

source: 说明：消息数量上限用于控制传入的对话数量，其作用在于合理控制上下文长度，避免因消息过多导致系统处理复杂、资源消耗大以及用户体验受影响等问题，默认值为 20。
en: Note: The message limit is used to control the number of incoming conversations, aiming to reasonably manage context length and avoid issues such as complex system processing, high resource consumption, and negative impacts on user experience due to excessive messages. The default value is 20.
he: הערה: מגבלת ההודעות משמשת לשליטה במספר השיחות הנכנסות, במטרה לנהל את אורך ההקשר באופן סביר ולהימנע מבעיות כגון עיבוד מערכת מורכב, צריכת משאבים גבוהה והשפעות שליליות על חווית המשתמש עקב הודעות מוגזמות. ערך ברירת המחדל הוא 20.

source: 说明：用于控制模型生成的回复中最多包含多少个词元（tokens）。通过设置 max_tokens，可以限制生成文本的长度，确保其符合预期的长度要求。默认为不设置。
en: Description: Used to control how many word elements (tokens) are included in the maximum number of responses generated by the model. By setting max_tokens, you can limit the length of the generated text to ensure it meets the expected length requirements. The default is not set.
he: תיאור: משמש כדי לשלוט בכמה רכיבי מילים (אסימונים) כלולים במספר המרבי של תגובות שנוצרות על ידי המודל. על ידי הגדרת max_tokens, אתה יכול להגביל את אורך הטקסט שנוצר כדי להבטיח שהוא עומד בדרישות האורך הצפויות. ברירת המחדל אינה מוגדרת.

source: 说明：累积概率控制选择的词汇范围，较低时限制了生成的多样性，较高时生成的文本更加开放和多样。默认为不设置。
en: Description: cumulative probability controls the range of words selected, lower limits the diversity of generation, higher generates more open and diverse text. The default is not set.
he: תיאור: הסתברות מצטברת שולטת בטווח המילים הנבחרות, נמוכה יותר מגבילה את גיוון הדור, גבוהה יותר מייצרת טקסט פתוח ומגוון יותר. ברירת המחדל אינה מוגדרת.

source: 说明：采样温度参数影响模型的创造性和稳定性：温度越高，生成内容更有创意但易出错；温度越低，回答更保守稳定。默认为不设置。
en: Description: the sampling temperature parameter affects the creativity and stability of the model: the higher the temperature, the more creative but error-prone the generated content; the lower the temperature, the more conservative and stable the answers. The default is not set.
he: תיאור: פרמטר טמפרטורת הדגימה משפיע על היצירתיות והיציבות של המודל: ככל שהטמפרטורה גבוהה יותר, כך התוכן שנוצר יותר יצירתי אך מועד לשגיאות; ככל שהטמפרטורה נמוכה יותר, התשובות שמרניות ויציבות יותר. ברירת המחדל אינה מוגדרת.

source: 请提供 JSON 文件，格式要求与本软件导出的 JSON 文件格式一致，本软件采用 OpenAI 的请求 JSON 格式，包括文本对话和含图片的多模态对话，图片使用 base64 数据。
en: Please provide a JSON file that matches the format exported by this software: OpenAI’s request JSON format, including text dialogues and multimodal dialogues with images encoded in base64.
he: אנא ספק קובץ JSON התואם לפורמט המיוצא על ידי תוכנה זו: פורמט JSON הבקשה של OpenAI, כולל דיאלוגים של טקסט ודיאלוגים מולטי-מודאליים עם תמונות מקודדות ב-base64.

source: 请求地址
en: Request Address
he: Request Address

source: 请求地址（URL）
en: Request URLs
he: Request URLs

source: 请输入 API Host
en: Please enter the API Host
he: נא להזין API Host

source: 请输入 API Key
en: Please enter the API key
he: נא להזין API Key

source: 请输入 API 密钥
en: Please enter the API key.
he: נא להזין API Key.

source: 请输入你的昵称
en: Please enter your nickname
he: Please enter your nickname

source: 请输入供应商名称
en: Please enter the supplier name.
he: Please enter the supplier name.

source: 请输入密钥
en: Please enter the API key
he: נא להזין API Key

source: 请输入新的标题
en: Please enter a new title
he: Please enter a new title

source: 请输入标题
en: Please enter the title
he: Please enter the title

source: 请输入模型名称
en: Please enter the model name
he: נא להזין את שם המודל

source: 请输入知识名称
en: Please enter the name for the knowledge
he: Please enter the name for the knowledge

source: 请输入网页 URL
en: Please enter the webpage URL
he: Please enter the webpage URL

source: 请输入群聊名称
en: Please enter the group chat name
he: נא להזין את שם הצ׳אט הקבוצתי

source: 请输入请求地址
en: Please enter the request URLs
he: Please enter the request URLs

source: 调整模型参数
en: Adjust Model Parameters
he: Adjust Model Parameters

source: 调整累积概率
en: Adjust Cumulative Probability
he: Adjust Cumulative Probability

source: 调整采样温度
en: Adjust Sampling Temperature
he: Adjust Sampling Temperature

source: 资料内容
en: Information Content
he: Information Content

source: 身份选择
en: Identity Selection
he: Identity Selection

source: 软件
en: Software
he: Software

source: 软件介绍
en: Software Introduction
he: Software Introduction

source: 软件信息
en: Software Information
he: Software Information

source: 软件含有AI生成信息，请注意鉴别
en: This software contains AI-generated content; please verify its authenticity.
he: תוכנה זו מכילה תוכן שנוצר בינה מלאכותית; נא לאמת את האותנטיות שלו.

source: 软件指南
en: Software Guide
he: מדריך התוכנה

source: 输入名称
en: Enter the name here
he: Enter the name here

source: 输入工具
en: Input Tools
he: Input Tools

source: 输入翻译词汇
en: Input Translation Dictionary
he: Input Translation Dictionary

source: 运行画布代码
en: Run Canvas Codes
he: Run Canvas Codes

source: 运行程序代码
en: Run Program Codes
he: Run Program Codes

source: 返回
en: return
he: לַחֲזוֹר

source: 这是一段示例消息内容...
en: This is a Sample Message...
he: This is a Sample Message...

source: 这里设定的 System 角色的消息在大模型中起着至关重要的作用，通常用于设定对话的上下文、风格、身份与行为边界，是构建高质量对话系统的关键机制之一。
en: The messages of the System role set here play a crucial role in the large model, typically used to establish the context, style, identity, and behavioral boundaries of the conversation. It is one of the key mechanisms for building high-quality dialogue systems.
he: המסרים של תפקיד המערכת המוגדרים כאן ממלאים תפקיד מכריע במודל הגדול, המשמש בדרך כלל לביסוס ההקשר, הסגנון, הזהות והגבולות ההתנהגותיים של השיחה. זהו אחד המנגנונים המרכזיים לבניית מערכות דיאלוג איכותיות.

source: 退出编辑模式
en: Exit Edit Mode
he: Exit Edit Mode

source: 适中 (0.001-0.006/千tokens)
en: Moderate (¥0.001–¥0.006 / Ktokens)
he: בינוני (¥0.001–¥0.006 / Ktokens)

source: 选择OCR的图片来源
en: Select OCR Image Source
he: Select OCR Image Source

source: 选择向量模型（仅启用一个）
en: Select an Embedding Model
he: בחירת מודל הטמעה

source: 选择图标
en: Select the Icon
he: Select the Icon

source: 选择基础模型
en: Select the Base Model
he: בחירת מודל בסיס

source: 选择导出格式
en: Select Export Format
he: Select Export Format

source: 选择文本
en: Select Text
he: Select Text

source: 选择文本优化模型
en: Select a Text Optimization Model
he: בחירת מודל אופטימיזציית טקסט

source: 选择模型
en: Select Model
he: Select Model

source: 选择视觉优化模型
en: Select a Visual Optimization Model
he: בחירת מודל אופטימיזציית ראייה

source: 选择系统提示词
en: Select System Prompts
he: Select System Prompts

source: 选择语音模型（仅启用一个）
en: Select a Speech Model
he: Select a Speech Model

source: 通用
en: General
he: General

source: 通用设置包含语言和触感反馈等基础配置项。
en: General settings include basic configuration items like language and haptic feedback
he: General settings include basic configuration items like language and haptic feedback

source: 通过选择新的基础模型复制该智能体
en: By selecting a new base model to replicate the agent.
he: By selecting a new base model to replicate the agent.

source: 邮箱已复制到剪贴板
en: The email has been copied to the clipboard.
he: The email has been copied to the clipboard.

source: 采样温度参数调节 (temperature)
en: Sampling temperature parameter adjustment (temperature)
he: התאמת פרמטר של טמפרטורת דגימה (טמפרטורה)

source: 重新请求
en: Request Again
he: Request Again

source: 链接包含未知信息 打开链接将离开AI翰林院
en: The link contains unknown information. Opening it will take you away from AI Hanlin.
he: The link contains unknown information. Opening it will take you away from AI Hanlin.

source: 错误
en: Error
he: Error

source: 附近兴趣搜索
en: Nearby Interests Search
he: חיפוש עניין בקרבת מקום

source: 音频
en: Voice
he: Voice

source: 项目创建于2025年2月·新加坡
en: Project created in February 2025, Singapore.
he: הפרויקט נוצר בפברואר 2025, סינגפור.

source: 验证失败
en: Verification Failed
he: Verification Failed

source: 默认
en: Default
he: Default

source: 默认系统消息
en: Default System Message
he: Default System Message

source: 默认隐藏智能体
en: Default Hidden Agent
he: Default Hidden Agent

source: 默认隐藏模型
en: Default Hidden Model
he: Default Hidden Model

source: 新群聊
en: New Group Chat
he: צ׳אט קבוצתי חדש

source: 欢迎加入新群聊👏
en: Welcome to the new group chat! 👏
he: ברוכים הבאים לצ׳אט הקבוצתי החדש! 👏

source: 暂无开启的大模型厂商，请前往“设置-模型-模型厂商”设置大模型密钥并启用厂商。
en: No large model providers are currently enabled. Please go to “Settings-Models-Model Vendors” to set a large model API key and enable a provider.
he: אין כרגע ספק מודלים גדול פעיל. עברו אל "הגדרות-מודלים-ספקי מודלים" כדי להגדיר API Key ולהפעיל ספק.

source: 暂未设置优化模型，请前往“设置-模型-优化模型”设置文本优化模型和视觉优化模型。
en: No optimization model has been set. Please go to “Settings-Models-Optimization Models” to set a text optimization model and a visual optimization model.
he: עדיין לא הוגדר מודל אופטימיזציה. עברו אל "הגדרות-מודלים-מודלי אופטימיזציה" כדי להגדיר מודל אופטימיזציית טקסט ומודל אופטימיזציית ראייה.

source: ) 提供润色
en: ) provides polish
he: ) מספק פולנית

source: ) 提供翻译
en: ) provides translation
he: ) מספק תרגום

source: ) 进行摘要
en: ) to summarize
he: ) לסיכום

source: )) API密钥，以开启该搜索引擎
en: )) API key to open the search engine
he: )) מפתח API לפתיחת מנוע החיפוש

source: , model.price))/分钟
en: , model.price))/minute
he: , model.price))/דקה

source: , price))/次
en: , price))/times
he: , מחיר))/פעמים

source: 例如：http://127.0.0.1:1234/v1/chat/completions
en: For example: http://127.0.0.1:1234/v1/chat/completions
he: לדוגמה: http://127.0.0.1:1234/v1/chat/completions

source: 匹配度阈值：%.2f
en: Matching threshold: %.2f
he: סף התאמה: %.2f

source: 提示词
en: prompt word
he: מילה מהירה

source: 暂无内容
en: No content yet
he: עדיין אין תוכן

source: 未命名提示词
en: unnamed prompt word
he: מילת הנחיה ללא שם

source: 未知
en: unknown
he: לא ידוע

source: 未知模型
en: unknown model
he: דגם לא ידוע

source: 未知错误
en: unknown error
he: שגיאה לא ידועה

# 链接包含未知信息 打开链接将离开AI翰林院
source: 链接包含未知信息\n打开链接将离开AI翰林院
en: Link contains unknown information\nOpening the link will leave the AI Hanlin Academy
he: הקישור מכיל מידע לא ידוע\nפתיחת הקישור תעזוב את האקדמיה של AI Hanlin

source: ¥%.4f/分钟
en: ¥%.4f/minute
he: ¥%.4f לדקה

source: ¥%.4f/次
en: ¥%.4f/time
he: ¥%.4f לזמן

source: %@ 需要有效的 API Key，请先设置密钥。
en: %@ requires a valid API Key, please set the key first.
he: %@ דורש מפתח API חוקי, אנא הגדר תחילה את המפתח.

source: %@ 需要配置 API Key 才能启用。
en: %@ needs to be configured with an API Key to enable it.
he: יש להגדיר את %@ עם מפתח API כדי להפעיל אותו.

source: API Key 不能为空
en: API Key cannot be empty
he: מפתח API לא יכול להיות ריק

source: ⚠️ 包含敏感内容！
en: ⚠️Contains sensitive content!
he: ⚠️מכיל תוכן רגיש!

source: ⚠️ 响应错误：%@
en: ⚠️ Response error: %@
he: ⚠️ שגיאת תגובה: %@

source: ⚠️ 数据同步失败: %@，本轮问答不会被同步。
en: ⚠️ Data synchronization failed: %@, this round of questions and answers will not be synchronized.
he: ⚠️ סנכרון הנתונים נכשל: %@, סבב השאלות והתשובות הזה לא יסונכרן.

source: ⚠️ 没有可用的多模态模型，请先在设置中添加支持视觉的模型。
en: ⚠️ There is no multi-modal model available, please add a vision-enabled model in settings first.
he: ⚠️ אין דגם רב-מודאלי זמין, אנא הוסף תחילה דגם המותאם לראייה בהגדרות.

source: ⚠️ 生成内容为空，请重新尝试！
en: ⚠️ The generated content is empty, please try again!
he: ⚠️ התוכן שנוצר ריק, אנא נסה שוב!

source: ⚠️ 识别失败：%@
en: ⚠️ Recognition failed: %@
he: ⚠️ זיהוי נכשל: %@

source: ⚠️ 输出长度到达模型最大输出长度！可在右上角模型参数中重新设置输出长度。
en: ⚠️ The output length reaches the maximum output length of the model! The output length can be reset in the model parameters in the upper right corner.
he: ⚠️ אורך הפלט מגיע לאורך הפלט המקסימלי של הדגם! ניתן לאפס את אורך הפלט בפרמטרים של הדגם בפינה הימנית העליונה.

source: 一切都是崭新的✨
en: Everything is brand new✨
he: הכל חדש לגמרי✨

source: 供应商名称不能为空
en: Supplier name cannot be empty
he: שם הספק לא יכול להיות ריק

source: 保存失败: %@
en: Failed to save: %@
he: השמירה נכשלה: %@

source: 保存失败：%@
en: Save failed: %@
he: השמירה נכשלה: %@

source: 前天
en: the day before yesterday
he: שלשום

source: 已思考%.1f秒
en: Thought for %.1f seconds
he: מחשבה במשך %.1f שניות

source: 已思考%d分钟%.1f秒
en: Thought %d minutes %.1f seconds
he: מחשבה %d דקות %.1f שניות

source: 已思考%d小时%d分钟%.1f秒
en: Thought %d hours %d minutes %.1f seconds
he: מחשבה %d שעות %d דקות %.1f שניות

source: 文件格式错误，请检查文件是否为导出时的正确格式。
en: File format error. Please check whether the file is in the correct format for export.
he: שגיאה בפורמט הקובץ. אנא בדוק אם הקובץ בפורמט הנכון לייצוא.

source: 新知识
en: new knowledge
he: ידע חדש

source: 无内容
en: No content
he: אין תוכן

source: 无名称
en: no name
he: ללא שם

source: 无文本
en: no text
he: ללא טקסט

source: 无法访问所选文件的权限。
en: Unable to access permissions for the selected file.
he: לא ניתן לגשת להרשאות עבור הקובץ שנבחר.

source: 昨天
en: yesterday
he: אֶתמוֹל

source: 系统
en: system
he: מַעֲרֶכֶת

source: 群聊名称被修改为“%@”
en: The group chat name was changed to "%@"
he: שם הצ'אט הקבוצתי השתנה ל-"%@"

source: 请求地址不能为空
en: The request address cannot be empty
he: כתובת הבקשה אינה יכולה להיות ריקה

source: 请求地址必须以 http:// 或 https:// 开头
en: The request address must start with http:// or https://
he: כתובת הבקשה חייבת להתחיל ב-http:// או https://

source: 🛑 响应已打断
en: 🛑 Response interrupted
he: 🛑 התגובה נקטעה

source: 暂未设置文本优化模型，请前往“设置-模型-优化模型”设置文本优化模型。视觉优化模型仅在视觉功能中需要。
en: No text optimization model has been set. Go to Settings - Models - Optimization Models and select a text optimization model. A visual optimization model is only required for Vision features.
he: לא הוגדר מודל אופטימיזציה לטקסט. עברו אל הגדרות - מודלים - מודלי אופטימיזציה ובחרו מודל טקסט. מודל ראייה נדרש רק עבור יכולות Vision.
